; domain
(define (domain elevators-sequencedstrips)
  (:requirements :typing :action-costs)
  (:types 	elevator - object
			slow-elevator fast-elevator - elevator
   			passenger - object
          	count - object
         )

(:predicates
	(passenger-at ?person - passenger ?floor - count)
	(boarded ?person - passenger ?lift - elevator)
	(lift-at ?lift - elevator ?floor - count)
	(reachable-floor ?lift - elevator ?floor - count)
	(above ?floor1 - count ?floor2 - count)
	(passengers ?lift - elevator ?n - count)
	(can-hold ?lift - elevator ?n - count)
	(next ?n1 - count ?n2 - count)
)

(:functions (total-cost) - number
            (travel-slow ?f1 - count ?f2 - count) - number
            (travel-fast ?f1 - count ?f2 - count) - number
)

(:action move-up-slow
  :parameters (?lift - slow-elevator ?f1 - count ?f2 - count )
  :precondition (and (lift-at ?lift ?f1) (above ?f1 ?f2 ) (reachable-floor ?lift ?f2) )
  :effect (and (lift-at ?lift ?f2) (not (lift-at ?lift ?f1)) (increase (total-cost) (travel-slow ?f1 ?f2))))

(:action move-down-slow
  :parameters (?lift - slow-elevator ?f1 - count ?f2 - count )
  :precondition (and (lift-at ?lift ?f1) (above ?f2 ?f1 ) (reachable-floor ?lift ?f2) )
  :effect (and (lift-at ?lift ?f2) (not (lift-at ?lift ?f1)) (increase (total-cost) (travel-slow ?f2 ?f1))))

(:action move-up-fast
  :parameters (?lift - fast-elevator ?f1 - count ?f2 - count )
  :precondition (and (lift-at ?lift ?f1) (above ?f1 ?f2 ) (reachable-floor ?lift ?f2) )
  :effect (and (lift-at ?lift ?f2) (not (lift-at ?lift ?f1)) (increase (total-cost) (travel-fast ?f1 ?f2))))

(:action move-down-fast
  :parameters (?lift - fast-elevator ?f1 - count ?f2 - count )
  :precondition (and (lift-at ?lift ?f1) (above ?f2 ?f1 ) (reachable-floor ?lift ?f2) )
  :effect (and (lift-at ?lift ?f2) (not (lift-at ?lift ?f1)) (increase (total-cost) (travel-fast ?f2 ?f1))))

(:action board
  :parameters (?p - passenger ?lift - elevator ?f - count ?n1 - count ?n2 - count)
  :precondition (and  (lift-at ?lift ?f) (passenger-at ?p ?f) (passengers ?lift ?n1) (next ?n1 ?n2) (can-hold ?lift ?n2) )
  :effect (and (not (passenger-at ?p ?f)) (boarded ?p ?lift) (not (passengers ?lift ?n1)) (passengers ?lift ?n2) ))

(:action leave
  :parameters (?p - passenger ?lift - elevator ?f - count ?n1 - count ?n2 - count)
  :precondition (and  (lift-at ?lift ?f) (boarded ?p ?lift) (passengers ?lift ?n1) (next ?n2 ?n1) )
  :effect (and (passenger-at ?p ?f) (not (boarded ?p ?lift)) (not (passengers ?lift ?n1)) (passengers ?lift ?n2) ))

)

; problem
; 19 floors, area size: 6, areas: 3, passengers: 3
(define (problem elevators)
(:domain elevators-sequencedstrips)
    (:objects
       n0 n1 n2 n3 n4 n5 n6 n7 n8 n9 n10 n11 n12 n13 n14 n15 n16 n17 n18 - count
       p0 p1 p2 - passenger
       fast0 fast1 fast2 - fast-elevator
       slow0-0 slow1-0 slow2-0 - slow-elevator
    )

    (:init
       (next n0 n1)
       (next n1 n2)
       (next n2 n3)
       (next n3 n4)
       (next n4 n5)
       (next n5 n6)
       (next n6 n7)
       (next n7 n8)
       (next n8 n9)
       (next n9 n10)
       (next n10 n11)
       (next n11 n12)
       (next n12 n13)
       (next n13 n14)
       (next n14 n15)
       (next n15 n16)
       (next n16 n17)
       (next n17 n18)

       (above n0 n1)
       (above n0 n2)
       (above n0 n3)
       (above n0 n4)
       (above n0 n5)
       (above n0 n6)
       (above n0 n7)
       (above n0 n8)
       (above n0 n9)
       (above n0 n10)
       (above n0 n11)
       (above n0 n12)
       (above n0 n13)
       (above n0 n14)
       (above n0 n15)
       (above n0 n16)
       (above n0 n17)
       (above n0 n18)
       (above n1 n2)
       (above n1 n3)
       (above n1 n4)
       (above n1 n5)
       (above n1 n6)
       (above n1 n7)
       (above n1 n8)
       (above n1 n9)
       (above n1 n10)
       (above n1 n11)
       (above n1 n12)
       (above n1 n13)
       (above n1 n14)
       (above n1 n15)
       (above n1 n16)
       (above n1 n17)
       (above n1 n18)
       (above n2 n3)
       (above n2 n4)
       (above n2 n5)
       (above n2 n6)
       (above n2 n7)
       (above n2 n8)
       (above n2 n9)
       (above n2 n10)
       (above n2 n11)
       (above n2 n12)
       (above n2 n13)
       (above n2 n14)
       (above n2 n15)
       (above n2 n16)
       (above n2 n17)
       (above n2 n18)
       (above n3 n4)
       (above n3 n5)
       (above n3 n6)
       (above n3 n7)
       (above n3 n8)
       (above n3 n9)
       (above n3 n10)
       (above n3 n11)
       (above n3 n12)
       (above n3 n13)
       (above n3 n14)
       (above n3 n15)
       (above n3 n16)
       (above n3 n17)
       (above n3 n18)
       (above n4 n5)
       (above n4 n6)
       (above n4 n7)
       (above n4 n8)
       (above n4 n9)
       (above n4 n10)
       (above n4 n11)
       (above n4 n12)
       (above n4 n13)
       (above n4 n14)
       (above n4 n15)
       (above n4 n16)
       (above n4 n17)
       (above n4 n18)
       (above n5 n6)
       (above n5 n7)
       (above n5 n8)
       (above n5 n9)
       (above n5 n10)
       (above n5 n11)
       (above n5 n12)
       (above n5 n13)
       (above n5 n14)
       (above n5 n15)
       (above n5 n16)
       (above n5 n17)
       (above n5 n18)
       (above n6 n7)
       (above n6 n8)
       (above n6 n9)
       (above n6 n10)
       (above n6 n11)
       (above n6 n12)
       (above n6 n13)
       (above n6 n14)
       (above n6 n15)
       (above n6 n16)
       (above n6 n17)
       (above n6 n18)
       (above n7 n8)
       (above n7 n9)
       (above n7 n10)
       (above n7 n11)
       (above n7 n12)
       (above n7 n13)
       (above n7 n14)
       (above n7 n15)
       (above n7 n16)
       (above n7 n17)
       (above n7 n18)
       (above n8 n9)
       (above n8 n10)
       (above n8 n11)
       (above n8 n12)
       (above n8 n13)
       (above n8 n14)
       (above n8 n15)
       (above n8 n16)
       (above n8 n17)
       (above n8 n18)
       (above n9 n10)
       (above n9 n11)
       (above n9 n12)
       (above n9 n13)
       (above n9 n14)
       (above n9 n15)
       (above n9 n16)
       (above n9 n17)
       (above n9 n18)
       (above n10 n11)
       (above n10 n12)
       (above n10 n13)
       (above n10 n14)
       (above n10 n15)
       (above n10 n16)
       (above n10 n17)
       (above n10 n18)
       (above n11 n12)
       (above n11 n13)
       (above n11 n14)
       (above n11 n15)
       (above n11 n16)
       (above n11 n17)
       (above n11 n18)
       (above n12 n13)
       (above n12 n14)
       (above n12 n15)
       (above n12 n16)
       (above n12 n17)
       (above n12 n18)
       (above n13 n14)
       (above n13 n15)
       (above n13 n16)
       (above n13 n17)
       (above n13 n18)
       (above n14 n15)
       (above n14 n16)
       (above n14 n17)
       (above n14 n18)
       (above n15 n16)
       (above n15 n17)
       (above n15 n18)
       (above n16 n17)
       (above n16 n18)
       (above n17 n18)

       (lift-at fast0 n15)
       (passengers fast0 n0)
       (can-hold fast0 n1) (can-hold fast0 n2) (can-hold fast0 n3)
       (reachable-floor fast0 n0) (reachable-floor fast0 n3) (reachable-floor fast0 n6) (reachable-floor fast0 n9) (reachable-floor fast0 n12) (reachable-floor fast0 n15) (reachable-floor fast0 n18)
    
       (lift-at fast1 n18)
       (passengers fast1 n0)
       (can-hold fast1 n1) (can-hold fast1 n2) (can-hold fast1 n3)
       (reachable-floor fast1 n0) (reachable-floor fast1 n3) (reachable-floor fast1 n6) (reachable-floor fast1 n9) (reachable-floor fast1 n12) (reachable-floor fast1 n15) (reachable-floor fast1 n18)
    
       (lift-at fast2 n3)
       (passengers fast2 n0)
       (can-hold fast2 n1) (can-hold fast2 n2) (can-hold fast2 n3)
       (reachable-floor fast2 n0) (reachable-floor fast2 n3) (reachable-floor fast2 n6) (reachable-floor fast2 n9) (reachable-floor fast2 n12) (reachable-floor fast2 n15) (reachable-floor fast2 n18)
    
       (lift-at slow0-0 n5)
       (passengers slow0-0 n0)
       (can-hold slow0-0 n1) (can-hold slow0-0 n2)
       (reachable-floor slow0-0 n0) (reachable-floor slow0-0 n1) (reachable-floor slow0-0 n2) (reachable-floor slow0-0 n3) (reachable-floor slow0-0 n4) (reachable-floor slow0-0 n5) (reachable-floor slow0-0 n6)
    
       (lift-at slow1-0 n7)
       (passengers slow1-0 n0)
       (can-hold slow1-0 n1) (can-hold slow1-0 n2)
       (reachable-floor slow1-0 n6) (reachable-floor slow1-0 n7) (reachable-floor slow1-0 n8) (reachable-floor slow1-0 n9) (reachable-floor slow1-0 n10) (reachable-floor slow1-0 n11) (reachable-floor slow1-0 n12)
    
       (lift-at slow2-0 n15)
       (passengers slow2-0 n0)
       (can-hold slow2-0 n1) (can-hold slow2-0 n2)
       (reachable-floor slow2-0 n12) (reachable-floor slow2-0 n13) (reachable-floor slow2-0 n14) (reachable-floor slow2-0 n15) (reachable-floor slow2-0 n16) (reachable-floor slow2-0 n17) (reachable-floor slow2-0 n18)
    

       (passenger-at p0 n8)
       (passenger-at p1 n13)
       (passenger-at p2 n6)

       (= (travel-slow n0 n1) 6)
       (= (travel-slow n0 n2) 7)
       (= (travel-slow n0 n3) 8)
       (= (travel-slow n0 n4) 9)
       (= (travel-slow n0 n5) 10)
       (= (travel-slow n0 n6) 11)
       (= (travel-slow n1 n2) 6)
       (= (travel-slow n1 n3) 7)
       (= (travel-slow n1 n4) 8)
       (= (travel-slow n1 n5) 9)
       (= (travel-slow n1 n6) 10)
       (= (travel-slow n2 n3) 6)
       (= (travel-slow n2 n4) 7)
       (= (travel-slow n2 n5) 8)
       (= (travel-slow n2 n6) 9)
       (= (travel-slow n3 n4) 6)
       (= (travel-slow n3 n5) 7)
       (= (travel-slow n3 n6) 8)
       (= (travel-slow n4 n5) 6)
       (= (travel-slow n4 n6) 7)
       (= (travel-slow n5 n6) 6)
       (= (travel-slow n6 n7) 6)
       (= (travel-slow n6 n8) 7)
       (= (travel-slow n6 n9) 8)
       (= (travel-slow n6 n10) 9)
       (= (travel-slow n6 n11) 10)
       (= (travel-slow n6 n12) 11)
       (= (travel-slow n7 n8) 6)
       (= (travel-slow n7 n9) 7)
       (= (travel-slow n7 n10) 8)
       (= (travel-slow n7 n11) 9)
       (= (travel-slow n7 n12) 10)
       (= (travel-slow n8 n9) 6)
       (= (travel-slow n8 n10) 7)
       (= (travel-slow n8 n11) 8)
       (= (travel-slow n8 n12) 9)
       (= (travel-slow n9 n10) 6)
       (= (travel-slow n9 n11) 7)
       (= (travel-slow n9 n12) 8)
       (= (travel-slow n10 n11) 6)
       (= (travel-slow n10 n12) 7)
       (= (travel-slow n11 n12) 6)
       (= (travel-slow n12 n13) 6)
       (= (travel-slow n12 n14) 7)
       (= (travel-slow n12 n15) 8)
       (= (travel-slow n12 n16) 9)
       (= (travel-slow n12 n17) 10)
       (= (travel-slow n12 n18) 11)
       (= (travel-slow n13 n14) 6)
       (= (travel-slow n13 n15) 7)
       (= (travel-slow n13 n16) 8)
       (= (travel-slow n13 n17) 9)
       (= (travel-slow n13 n18) 10)
       (= (travel-slow n14 n15) 6)
       (= (travel-slow n14 n16) 7)
       (= (travel-slow n14 n17) 8)
       (= (travel-slow n14 n18) 9)
       (= (travel-slow n15 n16) 6)
       (= (travel-slow n15 n17) 7)
       (= (travel-slow n15 n18) 8)
       (= (travel-slow n16 n17) 6)
       (= (travel-slow n16 n18) 7)
       (= (travel-slow n17 n18) 6)
       (= (travel-fast n0 n3) 10)
       (= (travel-fast n0 n6) 19)
       (= (travel-fast n0 n9) 28)
       (= (travel-fast n0 n12) 37)
       (= (travel-fast n0 n15) 46)
       (= (travel-fast n0 n18) 55)
       (= (travel-fast n3 n6) 10)
       (= (travel-fast n3 n9) 19)
       (= (travel-fast n3 n12) 28)
       (= (travel-fast n3 n15) 37)
       (= (travel-fast n3 n18) 46)
       (= (travel-fast n6 n9) 10)
       (= (travel-fast n6 n12) 19)
       (= (travel-fast n6 n15) 28)
       (= (travel-fast n6 n18) 37)
       (= (travel-fast n9 n12) 10)
       (= (travel-fast n9 n15) 19)
       (= (travel-fast n9 n18) 28)
       (= (travel-fast n12 n15) 10)
       (= (travel-fast n12 n18) 19)
       (= (travel-fast n15 n18) 10)

       (= (total-cost) 0)
    )

    (:goal (and
       (passenger-at p0 n12)
       (passenger-at p1 n15)
       (passenger-at p2 n10)
    ))

    (:metric minimize (total-cost))
)

; plan
1. (move-down-slow slow1-0 n7 n6)
   deleted: (lift-at slow1-0 n7)
   added: (lift-at slow1-0 n6)
   goals met: 0 of 3
2. (board p2 slow1-0 n6 n0 n1)
   deleted: (passenger-at p2 n6) (passengers slow1-0 n0)
   added: (boarded p2 slow1-0) (passengers slow1-0 n1)
   goals met: 0 of 3
3. (move-up-slow slow1-0 n6 n10)
   deleted: (lift-at slow1-0 n6)
   added: (lift-at slow1-0 n10)
   goals met: 0 of 3
4. (move-down-slow slow2-0 n15 n13)
   deleted: (lift-at slow2-0 n15)
   added: (lift-at slow2-0 n13)
   goals met: 0 of 3
5. (leave p2 slow1-0 n10 n1 n0)
   deleted: (boarded p2 slow1-0) (passengers slow1-0 n1)
   added: (passenger-at p2 n10) (passengers slow1-0 n0)
   goals met: 1 of 3
6. (move-down-slow slow1-0 n10 n8)
   deleted: (lift-at slow1-0 n10)
   added: (lift-at slow1-0 n8)
   goals met: 1 of 3
7. (board p1 slow2-0 n13 n0 n1)
   deleted: (passenger-at p1 n13) (passengers slow2-0 n0)
   added: (boarded p1 slow2-0) (passengers slow2-0 n1)
   goals met: 1 of 3
8. (board p0 slow1-0 n8 n0 n1)
   deleted: (passenger-at p0 n8) (passengers slow1-0 n0)
   added: (boarded p0 slow1-0) (passengers slow1-0 n1)
   goals met: 1 of 3
9. (move-up-slow slow1-0 n8 n12)
   deleted: (lift-at slow1-0 n8)
   added: (lift-at slow1-0 n12)
   goals met: 1 of 3
10. (leave p0 slow1-0 n12 n1 n0)
   deleted: (boarded p0 slow1-0) (passengers slow1-0 n1)
   added: (passenger-at p0 n12) (passengers slow1-0 n0)
   goals met: 2 of 3
11. (move-up-slow slow2-0 n13 n15)
   deleted: (lift-at slow2-0 n13)
   added: (lift-at slow2-0 n15)
   goals met: 2 of 3
12. (leave p1 slow2-0 n15 n1 n0)
   deleted: (boarded p1 slow2-0) (passengers slow2-0 n1)
   added: (passenger-at p1 n15) (passengers slow2-0 n0)
   goals met: 3 of 3
